backend/benchmarks/jmeter/fund_transfer.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  JMeter Test Plan: Fund Transfer Load Test
  Project: Neptune Bank - IEEE Research
  Author: Ayshi Shannidhya Panda

  Usage:
    jmeter -n -t fund_transfer.jmx -Jusers=5000 -Jduration=300 -Jrampup=60 -l results.csv

  Parameters (set via -J):
    users    = Number of concurrent threads (default: 100)
    duration = Test duration in seconds (default: 300)
    rampup   = Ramp-up period in seconds (default: 60)
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6">
  <hashTree>

    <!-- Test Plan -->
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Neptune Bank Fund Transfer Load Test" enabled="true">
      <stringProp name="TestPlan.comments">IEEE Research - Performance Evaluation of Event-Driven Banking Microservices</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">8084</stringProp>
          </elementProp>
          <elementProp name="AUTH_PORT" elementType="Argument">
            <stringProp name="Argument.name">AUTH_PORT</stringProp>
            <stringProp name="Argument.value">8086</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- Thread Group: Fund Transfer -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Fund Transfer Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(users,100)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,60)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,300)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>

        <!-- HTTP Header Manager -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- Random Variable: Source Account -->
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Source Account" enabled="true">
          <stringProp name="variableName">sourceAccount</stringProp>
          <stringProp name="outputFormat">NB000000000</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="maximumValue">1000</stringProp>
          <stringProp name="perThread">true</stringProp>
        </RandomVariableConfig>
        <hashTree/>

        <!-- Random Variable: Destination Account -->
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Destination Account" enabled="true">
          <stringProp name="variableName">destAccount</stringProp>
          <stringProp name="outputFormat">NB000000000</stringProp>
          <stringProp name="minimumValue">1001</stringProp>
          <stringProp name="maximumValue">2000</stringProp>
          <stringProp name="perThread">true</stringProp>
        </RandomVariableConfig>
        <hashTree/>

        <!-- Random Variable: Transfer Amount -->
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Amount" enabled="true">
          <stringProp name="variableName">amount</stringProp>
          <stringProp name="minimumValue">100</stringProp>
          <stringProp name="maximumValue">50000</stringProp>
          <stringProp name="perThread">true</stringProp>
        </RandomVariableConfig>
        <hashTree/>

        <!-- HTTP Request: Fund Transfer -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/transactions/transfer" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/transactions/transfer</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "sourceAccountNumber": "${sourceAccount}",
  "destinationAccountNumber": "${destAccount}",
  "amount": ${amount},
  "description": "IEEE benchmark fund transfer",
  "remarks": "Automated load test - ${__threadNum} - ${__time(yyyy-MM-dd HH:mm:ss)}",
  "sourceOrDestinationBank": {
    "bankName": "Neptune Bank",
    "bankIFSCCode": "NPTB0001234",
    "bankBranchName": "Main Branch",
    "bankBranchCity": "Sambalpur",
    "bankBranchState": "Odisha",
    "bankBranchCountry": "India",
    "bankBranchZipCode": "768001"
  }
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>

          <!-- Response Assertion -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert HTTP 2xx" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">2</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- JSON Extractor: Transaction ID -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Transaction ID" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">transactionId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.transactionId</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">NONE</stringProp>
          </JSONPostProcessor>
          <hashTree/>

        </hashTree>

        <!-- Constant Throughput Timer (simulates realistic think time) -->
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Throughput Limiter" enabled="false">
          <intProp name="calcMode">2</intProp>
          <doubleProp>
            <name>throughput</name>
            <value>600.0</value>
          </doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>

        <!-- Gaussian Random Timer (think time) -->
        <GaussianRandomTimer guiclass="GaussianRandomTimerGui" testclass="GaussianRandomTimer" testname="Think Time" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
          <stringProp name="RandomTimer.range">200</stringProp>
        </GaussianRandomTimer>
        <hashTree/>

        <!-- View Results Tree (disabled for batch mode — enable for debugging) -->
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

        <!-- Summary Report -->
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>